src/main/java/localDate/11.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                   xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <KwsSoapHeader xmlns="http://www.shijinet.com.cn/kunlun/kws/1.1/">
            <SessionId>1bf2a077-9b02-4541-b37e-1af06e047dc6</SessionId>
            <RetCode></RetCode>
            <ErrReason></ErrReason>
        </KwsSoapHeader>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <CreateReservation xmlns="http://www.shijinet.com.cn/kunlun/kws/1.1/">
            <oOrderInfo>
                <Arrival>2015-11-25</Arrival>
                <Departure>2015-11-26</Departure>
                <Hotel_code>
                    <code>VTJA</code>
                    <name></name>
                </Hotel_code>
                <Guesttype_code>
                    <code>0000</code>
                    <name></name>
                </Guesttype_code>
                <Member_id>
                    <code></code>
                    <name></name>
                </Member_id>
                <Account></Account>
                <Room_num>1</Room_num>
                <Roomtype_code>
                    <code>GTS</code>
                    <name></name>
                </Roomtype_code>
                <Rate_code>
                    <code>DDbar</code>
                    <name></name>
                </Rate_code>
                <Sex>M</Sex>
                <Comments>航班号为：</Comments>
                <Adults>1</Adults>
                <Children>0</Children>
                <Extra_bed>0</Extra_bed>
                <Firstname>xiansheng</Firstname>
                <Lastname>chen</Lastname>
                <Chname>chenxiansheng</Chname>
                <Mobile>13911598751</Mobile>
                <Email>498450009@qq.com</Email>
                <Languag_code>CN</Languag_code>
                <Title>Mr</Title>
                <Channel>
                    <code>IBE</code>
                    <name></name>
                </Channel>
                <ArrivalTime>12:00</ArrivalTime>
                <Reservation_type>
                    <code>N4PM</code>
                    <name></name>
                </Reservation_type>
            </oOrderInfo>
        </CreateReservation>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
